UCB_CS61_lec01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 00:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第一课 介绍 OO 语言</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第一课 介绍 OO 语言</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf419e40">1. THE LANGUAGE OF OBJECT-ORIENTED PROGRAMMING</a>
<ul>
<li><a href="#org6f86768">1.1. Java</a></li>
<li><a href="#orga7db34a">1.2. Postscript:  Anatomy of a Small Java Program (for discussion section)</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="orgf419e40" class="outline-2">
<h2 id="orgf419e40"><span class="section-number-2">1</span> THE LANGUAGE OF OBJECT-ORIENTED PROGRAMMING</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><code>Object</code>: An object is a repository of data. For example, if MyList is a
ShoppingList object, MyList might record your shopping list.</li>
</ul>


<ul class="org-ul">
<li><code>Class</code>: A class is a type of object. Many objects of the same class might
exist; for instance, MyList and YourList may both be ShoppingList objects.</li>
</ul>


<ul class="org-ul">
<li><code>Method</code>: A procedure or function that operates on an object or a class. A
method is associated with a particular class. For instance, addItem might be a
method that adds an item to any ShoppingList object. Sometimes a method is
associated with a family of classes. For instance, addItem might operate on
any List, of which a ShoppingList is just one type.</li>
</ul>


<ul class="org-ul">
<li><code>Inheritance</code>: A class may inherit properties from a more general class. For
example, the ShoppingList class inherits from the List class the property of
storing a sequence of items.</li>
</ul>


<ul class="org-ul">
<li><code>Polymorphism</code>: The ability to have one method call work on several different
classes of objects, even if those classes need different implementations of
the method call. For example, one line of code might be able to call the
"addItem" method on <span class="underline">every</span> kind of List, even though adding an item to a
ShoppingList is completely different from adding an item to a ShoppingCart.</li>
</ul>


<ul class="org-ul">
<li><code>Object-Oriented</code>: Each object knows its own class and which methods
manipulate objects in that class. Each ShoppingList and each ShoppingCart
knows which implementation of addItem applies to it.</li>
</ul>

<p>
In this list, the one thing that truly distinguishes object-oriented languages
from procedural languages (C, Fortran, Basic, Pascal) is polymorphism.
</p>
</div>
<div id="org6f86768" class="outline-3">
<h3 id="org6f86768"><span class="section-number-3">1.1</span> Java</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Java allows you to store data in variables, but first you must <span class="underline">declare</span> them
and specify their <span class="underline">type</span>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Python:  x = 1</td>
<td class="org-left">Scheme:  (let ((x 1)) )</td>
<td class="org-left">Java:  int x; x = 1;</td>
</tr>
</tbody>
</table>

<pre class="example">
This Java declaration does two things.
  1)  It allocates a chunk of memory big enough to store an integer, which
       Java calls type "int".                                               ---
  2)  It names the variable (chunk of memory) "x".                       x |1|
                                                                            ---
</pre>
<p>
Variables are used not just to store numbers, but also to <span class="underline">reference</span> objects.
There are two ways to get classes of objects to play with: 1)  Use one defined by somebody else.  Java has tons of pre-defined classes
     you can use.  Many come in the "Java standard library" provided with every
     Java compiler.
</p>
<ol class="org-ol">
<li>Define your own.</li>
</ol>

<p>
For example, Java has a built-in class called String.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #ce537a; font-weight: bold;">String</span> <span style="color: #7590db;">myString</span>;
</pre>
</div>

<p>
This does <span class="underline">not</span> create a String object.  Instead, it declares a variable (chunk
of memory) that can store a <span class="underline">reference</span> to a String object.  I draw it as a
box.
</p>

<pre class="example">
         ---
myString | |                   &lt;-- This box is a variable (not an object).
         ---
</pre>

<p>
Initially, myString doesn't reference anything.  You can make it reference a
String object by writing an assignment statement.  But how do we get ahold of
an actual String object?  You can create one.
</p>

<div class="org-src-container">
<pre class="src src-java">myString = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">String</span>();
</pre>
</div>

<p>
This line performs two distinct steps.  First, the phrase "new String()" is
called a <span class="underline">constructor</span>.  It constructs a brand new String object.  Second, the
assignment "=" causes myString to <span class="underline">reference</span> the object.  You can think of
this as myString pointing to the object.
</p>

<pre class="example">
         ---     ------
myString |.+----&gt;|    | a String object
         ---     ------
</pre>

<p>
Unlike Scheme and Python, Java programs must be compiled before you can run
them.  <span class="underline">Compilation</span> converts your written code to a machine-readable bytecode.
The advantage is a faster program than one written in Scheme.  The disadvantage
is that you have to wait for it to compile.
</p>

<pre class="example">
      Python                      Java
      ------                      ----
Python program (.py)         Java program (.java)
        |                           |
        | python                    | javac
        v                           v
      Answer                  .class files
                                    |
                                    | java
                                    v
                                  Answer

</pre>
</div>
</div>
<div id="orga7db34a" class="outline-3">
<h3 id="orga7db34a"><span class="section-number-3">1.2</span> Postscript:  Anatomy of a Small Java Program (for discussion section)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Assume the following code is in a file called HelloWorld.java:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">HelloWorld</span> {
  <span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">void</span> <span style="color: #bc6ec5; font-weight: bold;">main</span> (<span style="color: #ce537a; font-weight: bold;">String</span>[] <span style="color: #7590db;">args</span>) {
    System.out.println(<span style="color: #2d9574;">"Hello, world"</span>);
  }
}
</pre>
</div>

<p>
The classes are "HelloWorld", "String", and "System". The objects are "args",
"System.out", and the string "Hello, world". (Actually, the first two of these
are <span class="underline">references</span> to objects.) The methods are "main" and "println". The println
method prints its parameter, and the main method prints the string "Hello,
world".
</p>

<p>
You don't have the knowledge to completely understand this code yet, but don't
worry about it.  We'll take the first two lines on faith as the standard way to
start a Java program.  They'll become clear in the coming weeks.
</p>

<p>
Let's look at the innermost line first; it does all the action.  "out"
references an object whose class is PrintStream.  A PrintStream is a path by
which characters can be output by a program.  The characters that are sent
through "out" find their way to your computer screen.
</p>

<p>
System is a class which happens to contain the variable out (among many other
variables).  We have to write "System.out" to address the output stream,
because other classes might have variables called "out" too, with their own
meanings.
</p>

<p>
"println" is a method (procedure) of the class PrintStream.  Hence, we can
invoke "println" from any PrintStream object, including System.out.  "println"
takes one parameter, which can be a string.
</p>

<p>
"main" is a method in the "HelloWorld" class.  The HelloWorld class knows how
to do the "main" operation, just like the PrintStream class knows how to do the
"println" operation.
</p>

<pre class="example">
                                              ------------------------
------------------   ----------------------   |                      |
|                |   |                    |   |                      |
|        ---     |   |  println (method)  |   |                      |
|    out |.+-----+--&gt;|                    |   |                      |
|        ---     |   |                    |   |    main (method)     |
--System (class)--   --An object of class--   |                      |
                          PrintStream         |                      |
                                              ---HelloWorld (class)---
</pre>

<p>
The classes System and PrintStream are all automatically provided for you by any
Java compiler. Somebody has programmed them for you, so that you don't have to
figure out for yourself how to send characters to the terminal.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
